# Inference with OpenAI and RAG

In [ ]:
!pip install openai

Collecting openai
  Downloading openai-1.36.1-py3-none-any.whl (328 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 328.8/328.8 kB 9.7 MB/s eta 0:00:00
Requirement already satisfied: anyio<5,>=3.5.0 in /usr/local/lib/python3.10/dist-packages (from openai) (3.7.1)
Requirement already satisfied: distro<2,>=1.7.0 in /usr/lib/python3/dist-packages (from openai) (1.7.0)
Collecting httpx<1,>=0.23.0 (from openai)
  Downloading httpx-0.27.0-py3-none-any.whl (75 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 75.6/75.6 kB 7.4 MB/s eta 0:00:00
Requirement already satisfied: pydantic<3,>=1.9.0 in /usr/local/lib/python3.10/dist-packages (from openai) (2.8.2)
Requirement already satisfied: sniffio in /usr/local/lib/python3.10/dist-packages (from openai) (1.3.1)
Requirement already satisfied: tqdm>4 in /usr/local/lib/python3.10/dist-packages (from openai) (4.66.4)
Requirement already satisfied: typing-extensions<5,>=4.7 in /usr/local/lib/python3.10/dist-packages (from openai) (4.12.2)
Requirement already satisfied: idna>=2.8 in /usr/local/lib/python3.10/dist-packages (from anyio<5,>=3.5.0->openai) (3.7)
Requirement already satisfied: exceptiongroup in /usr/local/lib/python3.10/dist-packages (from anyio<5,>=3.5.0->openai) (1.2.2)
Requirement already satisfied: certifi in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->openai) (2024.7.4)
Collecting httpcore==1.* (from httpx<1,>=0.23.0->openai)
  Downloading httpcore-1.0.5-py3-none-any.whl (77 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 77.9/77.9 kB 8.1 MB/s eta 0:00:00
Collecting h11<0.15,>=0.13 (from httpcore==1.*->httpx<1,>=0.23.0->openai)
  Downloading h11-0.14.0-py3-none-any.whl (58 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 58.3/58.3 kB 6.1 MB/s eta 0:00:00
Requirement already satisfied: annotated-types>=0.4.0 in /usr/local/lib/python3.10/dist-packages (from pydantic<3,>=1.9.0->openai) (0.7.0)
Requirement already satisfied: pydantic-core==2.20.1 in /usr/local/lib/python3.10/dist-packages (from pydantic<3,>=1.9.0->openai) (2.20.1)
Installing collected packages: h11, httpcore, httpx, openai
Successfully installed h11-0.14.0 httpcore-1.0.5 httpx-0.27.0 openai-1.36.1

In [ ]:
import json

similar_test_path = "/content/drive/MyDrive/spider/test_similar_questions/sampled_similar_questions_v2.json"
with open(similar_test_path, 'r') as f:
    similar_data = json.load(f)

In [ ]:
db_test_path = "/content/drive/MyDrive/spider/db_tables_str.json"
with open(db_test_path, 'r') as f:
    db_data = json.load(f)

In [ ]:
## similar samples and table info
alpaca_prompt = """
### Instruction:
You are a helpful assistant that produces SQL Queries from the given question.
You should output a SQL query that is syntactically correct and can be executed without error.
In the input, you will recieve the question and similar text-to-sql pairs in addition to database tables for question.
Please output in the following format so it would be easy to extract SQL query. You should put sql code between
```sql SQL ```:
```sql
SELECT count(*) FROM head WHERE age  >  56;
```


### Input:
{}

Question: {}
Database: {}
Database tables:
{}

SQL:
"""

In [ ]:
## Just table info
alpaca_prompt_v2 = """
### Instruction:
You are a helpful assistant that produces SQL Queries from the given question.
You should output a SQL query that is syntactically correct and can be executed without error.
In the input, you will recieve the question and  database tables for question.
Please output in the following format so it would be easy to extract SQL query. You should put sql code between
```sql SQL ```:
```sql
SELECT count(*) FROM head WHERE age  >  56;
```


### Input:

Question: {}
Database: {}
Database tables:
{}

SQL:
"""

In [ ]:
import os
from openai import OpenAI

client = OpenAI(
    # This is the default and can be omitted
    api_key="OPEN_AI_KEY",
)

In [ ]:
import openai
import re
import time

# Function to extract SQL statements from text
def extract_sql_statements(text):
    sql_statements = re.findall(r'```sql(.*?)```', text, re.DOTALL)
    return [statement.strip() for statement in sql_statements]

# Function to generate SQL query using OpenAI's API
def generate_sql_query(similar_data, db_data, alpaca_prompt):
    predicted_queries = []
    full_results = []

    for item in similar_data:
        time.sleep(2)
        question = item['question']
        db_id = item['db_id']
        tabs = db_data[db_id]
        prompt = alpaca_prompt.format(question, db_id, "\n".join(tabs))
        response = client.chat.completions.create(
            model="gpt-3.5-turbo",
            messages=[
                {"role": "system", "content": "You are a helpful assistant that produces SQL Queries from the given question."},
                {"role": "user", "content": prompt}
            ],
            max_tokens=2000,
            temperature=0
        )
        output_text = response.choices[0].message.content
        sql_query = extract_sql_statements(output_text)[-1]
        sql = sql_query.split(";")[0] + ";"
        predicted_queries.append(sql)
        print(sql)
        full_results.append(output_text)

    return predicted_queries, full_results

In [ ]:
predicted_queries, full_results = generate_sql_query(similar_data, db_data, alpaca_prompt_v2)

SELECT s.name
FROM sailors s
JOIN reserves r ON s.sid = r.sid
WHERE r.bid = 103;
SELECT s.name
FROM sailors s
JOIN reserves r ON s.sid = r.sid
JOIN boats b ON r.bid = b.bid
WHERE b.name = 'Melon';
SELECT AVG(Units_sold_Millions) AS avg_units_sold
FROM game
JOIN game_player ON game.Game_ID = game_player.Game_ID
JOIN player ON game_player.Player_ID = player.Player_ID
WHERE player.Position = 'Guard';
SELECT Collection_Subset_Name
FROM collections
WHERE Parent_Collection_ID = (SELECT Collection_ID FROM collections WHERE Collection_Name = 'Best');
SELECT Analytical_Layer_Type_Code, COUNT(*) AS appearance_count
FROM analytical_layer
GROUP BY Analytical_Layer_Type_Code
ORDER BY appearance_count DESC
LIMIT 1;
SELECT Nationality, COUNT(Customer_ID) AS Number_of_Customers
FROM customer
GROUP BY Nationality;
SELECT c.customer_id, c.customer_name, c.customer_phone, c.customer_email
FROM customers c
JOIN customer_orders co ON c.customer_id = co.customer_id
GROUP BY c.customer_id, c.customer_name, c.customer_phone, c.customer_email
ORDER BY COUNT(co.order_id) DESC
LIMIT 1;
SELECT name
FROM staff
WHERE Age > (SELECT AVG(Age) FROM staff);
SELECT invoice_id, invoice_status, invoice_details
FROM invoices
WHERE invoice_id = (SELECT invoice_id
                    FROM payments
                    GROUP BY invoice_id
                    ORDER BY COUNT(*) DESC
                    LIMIT 1);
SELECT product_name
FROM products
WHERE product_price > (SELECT AVG(product_price) FROM products);
SELECT SUM(Weight) AS TotalWeight
FROM package
WHERE Sender = 'Leo Wong';
SELECT pilot_name, age
FROM skills
WHERE (plane_name = 'Piper Cub' AND age > 35)
OR (plane_name = 'F-14 Fighter' AND age < 30);
SELECT client_id
FROM invoices
GROUP BY client_id
HAVING COUNT(*) >= 2;
SELECT DISTINCT ds.Document_Subset_Name
FROM document_subset_members dsm
JOIN document_objects do ON dsm.Document_Object_ID = do.Document_Object_ID
JOIN document_subsets ds ON dsm.Document_Subset_ID = ds.Document_Subset_ID
WHERE do.Owner = 'Braeden';
SELECT AVG(distance)
FROM direct_distance
WHERE city1_code = 'Boston';
SELECT COUNT(DISTINCT Movie) AS distinct_movies FROM movie_theaters;
SELECT age_category_description
FROM users
JOIN age_categories ON users.age_category_code = age_categories.age_category_code
WHERE description LIKE '%Mother%';
SELECT b.ISBN, COUNT(bo.IdOrder) AS OrderCount
FROM book b
LEFT JOIN books_order bo ON b.ISBN = bo.ISBN
GROUP BY b.ISBN;
SELECT DISTINCT p1.pilot_name
FROM pilot_skills p1
WHERE EXISTS (
    SELECT 1
    FROM pilot_skills p2
    WHERE p1.pilot_name = p2.pilot_name
    AND p2.plane_name IN (
        SELECT plane_name
        FROM hangar
        WHERE location = 'Austin'
    )
)
AND EXISTS (
    SELECT 1
    FROM pilot_skills p3
    WHERE p1.pilot_name = p3.pilot_name
    AND p3.plane_name IN (
        SELECT plane_name
        FROM hangar
        WHERE location = 'Boston'
    )
);
SELECT a.Name, a.Gender
FROM author a
JOIN book b ON a.Author_ID = b.Author_ID
GROUP BY a.Author_ID
ORDER BY COUNT(b.Book_ID) DESC
LIMIT 1;
SELECT COUNT(DISTINCT p.pilot_name)
FROM pilot_skills p
JOIN hangar h ON p.plane_name = h.plane_name
WHERE h.location = 'Chicago';
SELECT c.Customer_ID, c.Customer_Details
FROM customers c
JOIN customers_and_services cs ON c.Customer_ID = cs.Customer_ID
GROUP BY c.Customer_ID, c.Customer_Details
ORDER BY COUNT(cs.Service_ID) DESC
LIMIT 1;
SELECT DISTINCT r.CustomerId
FROM receipts r
JOIN items i ON r.ReceiptNumber = i.Receipt
JOIN goods g ON i.Item = g.Id
GROUP BY r.CustomerId
HAVING AVG(g.Price) > 5;
SELECT product_name
FROM products
WHERE product_id NOT IN (SELECT product_id FROM order_items);
SELECT d.Document_Object_ID, COUNT(dc.Document_Object_ID) AS num_related_documents
FROM documents_in_collections dc
JOIN document_objects d ON dc.Document_Object_ID = d.Document_Object_ID
GROUP BY d.Document_Object_ID
HAVING COUNT(dc.Document_Object_ID) BETWEEN 2 AND 4;
SELECT detention_type_code, detention_type_description
FROM reference_detention_type
ORDER BY detention_type_code
LIMIT 1;
SELECT Student_Answer_Text
FROM student_answers
ORDER BY COUNT(*) DESC;
SELECT c1.Collection_Name
FROM collections c1
LEFT JOIN collections c2 ON c1.Collection_ID = c2.Parent_Collection_ID
WHERE c2.Parent_Collection_ID IS NULL;
SELECT c.Name, co.Dish_Name
FROM customer c
JOIN customer_order co ON c.Customer_ID = co.Customer_ID;
SELECT fname, lname
FROM artists
WHERE artistID IN (
    SELECT painterID
    FROM paintings
    WHERE painterID NOT IN (
        SELECT sculptorID
        FROM sculptures
    )
);
SELECT sa.Email_Adress, sa.Date_of_Answer
FROM students s
JOIN student answers sa ON s.Student_ID = sa.Student_ID
ORDER BY sa.Date_of_Answer DESC;
SELECT r.Transmitter, COUNT(cc.City_channel_ID) AS Number_of_City_Channels
FROM radio r
JOIN city_channel_radio ccr ON r.Radio_ID = ccr.Radio_ID
GROUP BY r.Transmitter;
SELECT hangar.location AS city, COUNT(pilot_name) AS number_of_pilots, AVG(age) AS average_age
FROM hangar
JOIN skills ON hangar.plane_name = skills.plane_name
GROUP BY hangar.location;
SELECT a.name AS affiliation_name, COUNT(pl.paper_id) AS paper_count
FROM affiliation a
JOIN author_list al ON a.affiliation_id = al.affiliation_id
JOIN paper p ON al.paper_id = p.paper_id
WHERE p.year = 2009
GROUP BY a.name
ORDER BY paper_count DESC
LIMIT 3;
SELECT m.start_date_time, m.end_date_time, c.client_details, s.staff_details
FROM meetings m
JOIN clients c ON m.client_id = c.client_id
JOIN staff_in_meetings sm ON m.meeting_id = sm.meeting_id
JOIN staff s ON sm.staff_id = s.staff_id;
SELECT s.First_Name, sa.Date_of_Answer
FROM students s
JOIN student answers sa ON s.Student_ID = sa.Student_ID;
SELECT COUNT(*)
FROM pilot_skills
WHERE plane_name IN (SELECT plane_name FROM hangar WHERE location = 'Chicago');
SELECT Title
FROM book_1.book
WHERE ISBN IN (SELECT ISBN FROM book_1.books_order);
SELECT date_of_transcript AS transcript_issuance_date
FROM transcripts
WHERE student_id = (
    SELECT student_id
    FROM student_loans
    ORDER BY amount_of_loan DESC
    LIMIT 1
);
SELECT agency_id
FROM agencies
WHERE agency_id NOT IN (SELECT DISTINCT agency_id FROM clients);
SELECT Conference_Name, COUNT(*) AS Conference_Count
FROM conference
GROUP BY Conference_Name;
SELECT DISTINCT d.Owner
FROM document_objects d
JOIN documents_in_collections dic ON d.Document_Object_ID = dic.Document_Object_ID
JOIN documents_in_collections dic_braeden ON dic.Collection_ID = dic_braeden.Collection_ID
JOIN document_objects d_braeden ON dic_braeden.Document_Object_ID = d_braeden.Document_Object_ID
WHERE d.Owner <> 'Braeden' AND d_braeden.Owner = 'Braeden';
SELECT SUM(Population) AS total_population, AVG(Population) AS average_population
FROM district
WHERE District_ID IN (SELECT District_ID FROM spokesman_district);
SELECT pilot_name
FROM skills
WHERE plane_name = 'Piper Cub'
AND pilot_name NOT IN (
    SELECT pilot_name
    FROM skills
    WHERE plane_name = 'B-52 Bomber'
);
SELECT Conference_Name
FROM conference
WHERE Conference_ID IN (
    SELECT Conference_ID
    FROM conference_participation
    GROUP BY Conference_ID
    ORDER BY COUNT(*) DESC
    LIMIT 2
);
SELECT Contents, SUM(Value) AS total_value, COUNT(*) AS number_of_boxes
FROM boxes
GROUP BY Contents;
SELECT PackageNumber, Weight
FROM package
WHERE Sender IN (SELECT AccountNumber FROM client WHERE Name LIKE '%John%')
ORDER BY Weight DESC
LIMIT 1;
SELECT DISTINCT stage_presence
FROM performance_score ps
JOIN songs s ON ps.song_id = s.id
WHERE s.language = 'English';
SELECT s.First_Name, sa.Date_of_Answer
FROM students s
JOIN student_answers sa ON s.Student_ID = sa.Student_ID;
SELECT plane_name, AVG(age) AS average_age
FROM pilot_skills
GROUP BY plane_name;
SELECT width_mm
FROM paintings
WHERE painterID IN (SELECT artistID FROM artists WHERE birthYear < 1850);
SELECT Neighborhood
FROM store
WHERE Neighborhood NOT IN (
    SELECT Neighborhood
    FROM stock
    JOIN headphone ON stock.Headphone_ID = headphone.Headphone_ID
);
SELECT g.Title
FROM game g
JOIN platform p ON g.Platform_ID = p.Platform_ID
WHERE p.Market_district IN ('Asia', 'USA');
SELECT s.bio_data, s.student_details
FROM students s
JOIN student_loans sl ON s.student_id = sl.student_id
WHERE sl.amount_of_loan > (SELECT AVG(amount_of_loan) FROM student_loans);
SELECT Name
FROM client
WHERE IdClient NOT IN (SELECT IdClient FROM orders);
SELECT Make
FROM team
GROUP BY Make
HAVING COUNT(DISTINCT Team_ID) > 1;
SELECT Location,
       SUM(Capacity) AS total_capacity,
       AVG(Capacity) AS average_capacity,
       MAX(Capacity) AS max_capacity
FROM warehouses
GROUP BY Location;
SELECT Player_name
FROM player
WHERE Player_ID NOT IN (SELECT Player_ID FROM game_player);
SELECT meetings.meeting_id, meetings.meeting_outcome, meetings.meeting_type, clients.client_details
FROM meetings
JOIN clients ON meetings.client_id = clients.client_id;
SELECT Type
FROM book
GROUP BY Type
HAVING COUNT(Book_ID) >= 3;
SELECT DISTINCT a.birthYear
FROM artists a
JOIN sculptures s ON a.artistID = s.sculptorID
WHERE s.year > 1920;
SELECT author_name
FROM authors
GROUP BY author_name
HAVING COUNT(document_id) >= 2;
SELECT Earpads, COUNT(Headphone_ID) AS Num_Headphones
FROM headphone
GROUP BY Earpads
ORDER BY Num_Headphones DESC
LIMIT 2;
SELECT a.fname AS first_name, COUNT(p.paintingID) AS number_of_paintings
FROM artists a
JOIN paintings p ON a.artistID = p.painterID
GROUP BY a.artistID, a.fname
HAVING COUNT(p.paintingID) >= 2;
SELECT Country
FROM player
GROUP BY Country
HAVING COUNT(Player_ID) > 1;
SELECT Analytical_Layer_Type_Code, COUNT(*) AS count
FROM analytical_layer
GROUP BY Analytical_Layer_Type_Code
ORDER BY count DESC
LIMIT 1;
SELECT s.name
FROM staff s
JOIN conference_participation cp1 ON s.staff_ID = cp1.staff_ID
JOIN conference_participation cp2 ON s.staff_ID = cp2.staff_ID
WHERE cp1.role = 'speaker' AND cp2.role = 'sponsor';
SELECT Construction, AVG(Price) AS Average_Cost
FROM headphone
GROUP BY Construction;
SELECT Manufacturer, COUNT(*) AS Manufacturer_Count
FROM club
GROUP BY Manufacturer
ORDER BY Manufacturer_Count DESC
LIMIT 1;
SELECT city.state
FROM student
JOIN city ON student.city_code = city.city_code
WHERE student.Fname = 'Linda';
SELECT d.Name
FROM driver d
JOIN vehicle_driver vd ON d.Driver_ID = vd.Driver_ID
JOIN vehicle v ON vd.Vehicle_ID = v.Vehicle_ID
WHERE v.Power > 5000;
SELECT COUNT(*)
FROM driver
JOIN vehicle_driver ON driver.Driver_ID = vehicle_driver.Driver_ID
JOIN vehicle ON vehicle_driver.Vehicle_ID = vehicle.Vehicle_ID
WHERE vehicle.Build_Year = 2012;
SELECT DISTINCT birthYear
FROM artists
WHERE artistID IN (
    SELECT sculptorID
    FROM sculptures
    WHERE year > 1920
);
SELECT w.Code
FROM warehouses w
JOIN (
    SELECT b.Warehouse, COUNT(*) AS num_boxes
    FROM boxes b
    GROUP BY b.Warehouse
) box_count ON w.Code = box_count.Warehouse
WHERE box_count.num_boxes > w.Capacity;
SELECT COUNT(*)
FROM author_list
WHERE author_id = (SELECT author_id FROM author WHERE name = 'Mckeown , Kathleen');
SELECT boxes.Code
FROM boxes
JOIN warehouses ON boxes.Warehouse = warehouses.Code
WHERE warehouses.Location IN ('Chicago', 'New York');
SELECT datestamp, property_name
FROM user_property_history
JOIN properties ON user_property_history.property_id = properties.property_id
ORDER BY datestamp;
SELECT PackageNumber
FROM package
WHERE Recipient = 'Leo Wong';
SELECT v.name, SUM(r.total_hours) AS total_rental_hours
FROM vehicles v
JOIN renting_history r ON v.id = r.vehicle_id
GROUP BY v.name;
SELECT invoices.invoice_id, COUNT(payments.payment_id) AS num_payments
FROM invoices
LEFT JOIN payments ON invoices.invoice_id = payments.invoice_id
GROUP BY invoices.invoice_id;
SELECT a.fname, a.lname
FROM artists a
WHERE EXISTS (
    SELECT 1
    FROM paintings p
    WHERE p.painterID = a.artistID
) AND EXISTS (
    SELECT 1
    FROM sculptures s
    WHERE s.sculptorID = a.artistID
);
SELECT COUNT(DISTINCT product_id)
FROM products
WHERE product_id NOT IN (SELECT DISTINCT product_id FROM order_items);
SELECT pilot_name
FROM pilot_skills
WHERE age < (SELECT AVG(age) FROM pilot_skills)
ORDER BY age ASC;
SELECT s.Service_Details
FROM services s
JOIN customers_and_services cs ON s.Service_ID = cs.Service_ID
JOIN customers c ON cs.Customer_ID = c.Customer_ID
WHERE c.Customer_Details = 'Hardy Kutch';
SELECT product_price, product_size
FROM products
WHERE product_price > (SELECT AVG(product_price) FROM products);
SELECT Rank
FROM review
WHERE Pages = (SELECT MIN(Pages) FROM book);
SELECT Name
FROM club
WHERE Club_ID NOT IN (SELECT Club_ID FROM player);
SELECT Model
FROM headphone
WHERE Headphone_ID NOT IN (
    SELECT Headphone_ID
    FROM stock
    WHERE Quantity > 0
);
SELECT c.Name, c.Internet
FROM channel c
JOIN program p ON c.Channel_ID = p.Channel_ID
GROUP BY c.Channel_ID
ORDER BY COUNT(DISTINCT p.Director_ID) DESC
LIMIT 1;
SELECT distance
FROM direct_distance
WHERE city1_code = 'Boston' AND city2_code = 'Newark';
SELECT name, SUM(total_hours) AS total_renting_hours
FROM vehicles
JOIN renting_history ON vehicles.id = renting_history.vehicles_id
GROUP BY name
ORDER BY total_renting_hours DESC;
SELECT s.sid, s.name
FROM sailors s
JOIN reserves r ON s.sid = r.sid
GROUP BY s.sid, s.name
HAVING COUNT(DISTINCT r.bid) > 1;
SELECT Completed_Year, COUNT(*) AS num_constructions
FROM building
GROUP BY Completed_Year
ORDER BY num_constructions DESC
LIMIT 1;
SELECT a.Name, a.Gender
FROM author a
JOIN book b ON a.Author_ID = b.Author_ID
GROUP BY a.Author_ID, a.Name, a.Gender
ORDER BY COUNT(b.Book_ID) DESC
LIMIT 1;
SELECT a.agency_id, a.agency_details
FROM agencies a
JOIN clients c ON a.agency_id = c.agency_id
GROUP BY a.agency_id, a.agency_details
HAVING COUNT(DISTINCT c.client_id) >= 2;
SELECT Name, Nickname
FROM institution
JOIN championship ON institution.Institution_ID = championship.Institution_ID;
SELECT product_color, product_description, product_size
FROM products
WHERE product_price < (SELECT MAX(product_price) FROM products);
SELECT COUNT(DISTINCT property_id)
FROM property_features
GROUP BY property_id
HAVING COUNT(feature_id) >= 2;
SELECT AVG(age) AS average_age, make
FROM driver
GROUP BY make;
SELECT Food, AVG(Price) AS AveragePrice, MIN(Price) AS MinPrice, MAX(Price) AS MaxPrice
FROM goods
GROUP BY Food;
SELECT Food, MIN(Price) AS LowestPrice, MAX(Price) AS HighestPrice
FROM goods
GROUP BY Food
ORDER BY Food;
SELECT p.paper_id, p.title
FROM paper p
JOIN author_list al1 ON p.paper_id = al1.paper_id
JOIN author a1 ON al1.author_id = a1.author_id
JOIN author_list al2 ON p.paper_id = al2.paper_id
JOIN author a2 ON al2.author_id = a2.author_id
WHERE (a1.name = 'Mckeown, Kathleen' AND a2.name = 'Rambow, Owen');
SELECT address_type_code, address_type_description
FROM reference address types
GROUP BY address_type_code, address_type_description
ORDER BY COUNT(*) DESC
LIMIT 1;
SELECT o.order_id, o.order_status_code, COUNT(oi.product_id) AS num_products
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
GROUP BY o.order_id, o.order_status_code;
SELECT product_id, product_name, product_price, product_color
FROM products
WHERE product_id IN (
    SELECT product_id
    FROM order_items
    GROUP BY product_id
    HAVING COUNT(DISTINCT order_id) < 2
);
SELECT COUNT(DISTINCT Warehouse)
FROM boxes
WHERE Contents = 'Rocks';
SELECT fname AS first_names, COUNT(*) AS number_of_works
FROM artists
WHERE artistID IN (
    SELECT painterID
    FROM paintings
    GROUP BY painterID
    HAVING COUNT(*) >= 2
);
SELECT major.Major_Name, major_ranking.Rank
FROM university
JOIN major_ranking ON university.University_ID = major_ranking.University_ID
JOIN major ON major_ranking.Major_ID = major.Major_ID
WHERE university.University_Name = 'Augustana College';
SELECT Name
FROM club
WHERE Club_ID NOT IN (SELECT Club_ID FROM player);
SELECT state, COUNT(city_name) AS number_of_cities
FROM city
GROUP BY state;
SELECT COUNT(*)
FROM package
WHERE Sender = 'Ogden Wernstrom'
AND Recipient = 'Leo Wong';
SELECT r.Name
FROM region r
LEFT JOIN building b ON r.Region_ID = b.Region_ID
WHERE b.Building_ID IS NULL;
SELECT b.Title
FROM book_1.book b
JOIN book_1.orders o ON b.ISBN = o.ISBN
JOIN book_1.client c ON o.IdClient = c.IdClient
WHERE c.Name = 'Peter Doe'
AND c.Name <> 'James Smith';
SELECT Earpads
FROM headphone
WHERE Construction <> 'plastic';
SELECT c.Capital
FROM country c
JOIN driver d ON c.Country_Id = d.Country
WHERE d.Points = (SELECT MAX(Points) FROM driver);
SELECT author.name, COUNT(*) AS num_papers
FROM author
JOIN author_list ON author.author_id = author_list.author_id
JOIN author_list AS al2 ON author_list.paper_id = al2.paper_id
JOIN author AS co_author ON al2.author_id = co_author.author_id
WHERE co_author.name = 'Mckeown , Kathleen'
GROUP BY author.author_id
ORDER BY num_papers DESC
LIMIT 1;
SELECT p.Name
FROM planet p
JOIN shipment s ON p.PlanetID = s.Planet
JOIN package pk ON s.ShipmentID = pk.Shipment
GROUP BY p.Name
HAVING SUM(pk.Weight) > 30;
SELECT city_name
FROM city
WHERE city_code = (
    SELECT city2_code
    FROM direct_distance
    WHERE city1_code = (
        SELECT city_code
        FROM city
        WHERE city_name = 'Boston'
    )
    ORDER BY distance DESC
    LIMIT 1
);
SELECT feature_name, feature_description
FROM features
WHERE feature_id IN (
    SELECT feature_id
    FROM property_features
    GROUP BY feature_id
    ORDER BY COUNT(*) DESC
    LIMIT 1
);
SELECT m.Title, mt.Name
FROM movies m
JOIN movie_theaters mt ON m.Code = mt.Movie;
SELECT product_id, product_description
FROM products
WHERE product_id IN (
    SELECT product_id
    FROM order_items
    GROUP BY product_id
    HAVING COUNT(*) > 3
);
SELECT process_name
FROM business_processes
WHERE process_id = (SELECT next_process_id FROM business_processes WHERE process_id = 9);
SELECT State
FROM university
WHERE Enrollment < 3000
GROUP BY State
HAVING COUNT(University_ID) > 2;
SELECT *
FROM package
WHERE Sender = 'Leo Wong' OR Recipient = 'Leo Wong';
SELECT dc."Document_Object_ID"
FROM "documents in collections" dc
JOIN "collections" c ON dc."Collection_ID" = c."Collection_ID"
JOIN "collections" c2 ON c."Collection_Name" = 'Best' AND c2."Collection_Name" = 'Best for 2000'
WHERE c2."Parent_Collection_ID" = c."Collection_ID";
SELECT c.customer_first_name, p.product_name
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
JOIN order_items oi ON o.order_id = oi.order_id
JOIN products p ON oi.product_id = p.product_id;
SELECT p1.pilot_name, p1.plane_name
FROM pilot_skills p1
WHERE p1.age = (
    SELECT MAX(p2.age)
    FROM pilot_skills p2
    WHERE p2.plane_name = p1.plane_name
);
SELECT name AS affiliation_name, COUNT(paper_id) AS num_papers
FROM affiliation
JOIN author_list ON affiliation.affiliation_id = author_list.affiliation_id
GROUP BY affiliation.affiliation_id, affiliation.name
ORDER BY num_papers DESC;
SELECT Warehouse, COUNT(DISTINCT Contents) AS NumDistinctContents
FROM boxes
GROUP BY Warehouse;
SELECT Nationality
FROM member
WHERE Age > 22 AND Nationality IN (
    SELECT Nationality
    FROM member
    WHERE Age < 19
);
SELECT u.University_Name
FROM university u
JOIN major_ranking mr1 ON u.University_ID = mr1.University_ID
JOIN major m1 ON mr1.Major_ID = m1.Major_ID AND m1.Major_Name = 'Accounting'
JOIN major_ranking mr2 ON u.University_ID = mr2.University_ID
JOIN major m2 ON mr2.Major_ID = m2.Major_ID AND m2.Major_Name = 'Urban Education';
SELECT s.bio_data
FROM students s
JOIN behaviour_monitoring bm ON s.student_id = bm.student_id
GROUP BY s.student_id
HAVING COUNT(DISTINCT bm.behaviour_monitoring_details) = (
    SELECT COUNT(*)
    FROM behaviour_monitoring
    GROUP BY student_id
    ORDER BY COUNT(*) DESC
    LIMIT 1
);
SELECT b.Title
FROM book_1.book b
JOIN book_1.books_order bo ON b.ISBN = bo.ISBN
JOIN book_1.orders o ON bo.IdOrder = o.IdOrder
JOIN book_1.client c ON o.IdClient = c.IdClient
WHERE c.Name = 'Peter Doe'
AND b.ISBN NOT IN (
    SELECT b2.ISBN
    FROM book_1.book b2
    JOIN book_1.books_order bo2 ON b2.ISBN = bo2.ISBN
    JOIN book_1.orders o2 ON bo2.IdOrder = o2.IdOrder

In [ ]:
predicted_queries

['SELECT s.name\nFROM sailors s\nJOIN reserves r ON s.sid = r.sid\nWHERE r.bid = 103;',
 "SELECT s.name\nFROM sailors s\nJOIN reserves r ON s.sid = r.sid\nJOIN boats b ON r.bid = b.bid\nWHERE b.name = 'Melon';",
 "SELECT AVG(Units_sold_Millions) AS avg_units_sold\nFROM game\nJOIN game_player ON game.Game_ID = game_player.Game_ID\nJOIN player ON game_player.Player_ID = player.Player_ID\nWHERE player.Position = 'Guard';",
 "SELECT Collection_Subset_Name\nFROM collections\nWHERE Parent_Collection_ID = (SELECT Collection_ID FROM collections WHERE Collection_Name = 'Best');",
 'SELECT Analytical_Layer_Type_Code, COUNT(*) AS appearance_count\nFROM analytical_layer\nGROUP BY Analytical_Layer_Type_Code\nORDER BY appearance_count DESC\nLIMIT 1;',
 'SELECT Nationality, COUNT(Customer_ID) AS Number_of_Customers\nFROM customer\nGROUP BY Nationality;',
 'SELECT c.customer_id, c.customer_name, c.customer_phone, c.customer_email\nFROM customers c\nJOIN customer_orders co ON c.customer_id = co.customer_id\nGROUP BY c.customer_id, c.customer_name, c.customer_phone, c.customer_email\nORDER BY COUNT(co.order_id) DESC\nLIMIT 1;',
 'SELECT name \nFROM staff \nWHERE Age > (SELECT AVG(Age) FROM staff);',
 'SELECT invoice_id, invoice_status, invoice_details\nFROM invoices\nWHERE invoice_id = (SELECT invoice_id\n                    FROM payments\n                    GROUP BY invoice_id\n                    ORDER BY COUNT(*) DESC\n                    LIMIT 1);',
 'SELECT product_name\nFROM products\nWHERE product_price > (SELECT AVG(product_price) FROM products);',
 "SELECT SUM(Weight) AS TotalWeight\nFROM package\nWHERE Sender = 'Leo Wong';",
 "SELECT pilot_name, age\nFROM skills\nWHERE (plane_name = 'Piper Cub' AND age > 35)\nOR (plane_name = 'F-14 Fighter' AND age < 30);",
 'SELECT client_id\nFROM invoices\nGROUP BY client_id\nHAVING COUNT(*) >= 2;',
 "SELECT DISTINCT ds.Document_Subset_Name\nFROM document_subset_members dsm\nJOIN document_objects do ON dsm.Document_Object_ID = do.Document_Object_ID\nJOIN document_subsets ds ON dsm.Document_Subset_ID = ds.Document_Subset_ID\nWHERE do.Owner = 'Braeden';",
 "SELECT AVG(distance) \nFROM direct_distance \nWHERE city1_code = 'Boston';",
 'SELECT COUNT(DISTINCT Movie) AS distinct_movies FROM movie_theaters;',
 "SELECT age_category_description\nFROM users\nJOIN age_categories ON users.age_category_code = age_categories.age_category_code\nWHERE description LIKE '%Mother%';",
 'SELECT b.ISBN, COUNT(bo.IdOrder) AS OrderCount\nFROM book b\nLEFT JOIN books_order bo ON b.ISBN = bo.ISBN\nGROUP BY b.ISBN;',
 "SELECT DISTINCT p1.pilot_name\nFROM pilot_skills p1\nWHERE EXISTS (\n    SELECT 1\n    FROM pilot_skills p2\n    WHERE p1.pilot_name = p2.pilot_name\n    AND p2.plane_name IN (\n        SELECT plane_name\n        FROM hangar\n        WHERE location = 'Austin'\n    )\n)\nAND EXISTS (\n    SELECT 1\n    FROM pilot_skills p3\n    WHERE p1.pilot_name = p3.pilot_name\n    AND p3.plane_name IN (\n        SELECT plane_name\n        FROM hangar\n        WHERE location = 'Boston'\n    )\n);",
 'SELECT a.Name, a.Gender\nFROM author a\nJOIN book b ON a.Author_ID = b.Author_ID\nGROUP BY a.Author_ID\nORDER BY COUNT(b.Book_ID) DESC\nLIMIT 1;',
 "SELECT COUNT(DISTINCT p.pilot_name) \nFROM pilot_skills p \nJOIN hangar h ON p.plane_name = h.plane_name \nWHERE h.location = 'Chicago';",
 'SELECT c.Customer_ID, c.Customer_Details\nFROM customers c\nJOIN customers_and_services cs ON c.Customer_ID = cs.Customer_ID\nGROUP BY c.Customer_ID, c.Customer_Details\nORDER BY COUNT(cs.Service_ID) DESC\nLIMIT 1;',
 'SELECT DISTINCT r.CustomerId\nFROM receipts r\nJOIN items i ON r.ReceiptNumber = i.Receipt\nJOIN goods g ON i.Item = g.Id\nGROUP BY r.CustomerId\nHAVING AVG(g.Price) > 5;',
 'SELECT product_name\nFROM products\nWHERE product_id NOT IN (SELECT product_id FROM order_items);',
 'SELECT d.Document_Object_ID, COUNT(dc.Document_Object_ID) AS num_related_documents\nFROM documents_in_collections dc\nJOIN document_objects d ON dc.Document_Object_ID = d.Document_Object_ID\nGROUP BY d.Document_Object_ID\nHAVING COUNT(dc.Document_Object_ID) BETWEEN 2 AND 4;',
 'SELECT detention_type_code, detention_type_description\nFROM reference_detention_type\nORDER BY detention_type_code\nLIMIT 1;',
 'SELECT Student_Answer_Text\nFROM student_answers\nORDER BY COUNT(*) DESC;',
 'SELECT c1.Collection_Name\nFROM collections c1\nLEFT JOIN collections c2 ON c1.Collection_ID = c2.Parent_Collection_ID\nWHERE c2.Parent_Collection_ID IS NULL;',
 'SELECT c.Name, co.Dish_Name\nFROM customer c\nJOIN customer_order co ON c.Customer_ID = co.Customer_ID;',
 'SELECT fname, lname\nFROM artists\nWHERE artistID IN (\n    SELECT painterID\n    FROM paintings\n    WHERE painterID NOT IN (\n        SELECT sculptorID\n        FROM sculptures\n    )\n);',
 'SELECT sa.Email_Adress, sa.Date_of_Answer\nFROM students s\nJOIN student answers sa ON s.Student_ID = sa.Student_ID\nORDER BY sa.Date_of_Answer DESC;',
 'SELECT r.Transmitter, COUNT(cc.City_channel_ID) AS Number_of_City_Channels\nFROM radio r\nJOIN city_channel_radio ccr ON r.Radio_ID = ccr.Radio_ID\nGROUP BY r.Transmitter;',
 'SELECT hangar.location AS city, COUNT(pilot_name) AS number_of_pilots, AVG(age) AS average_age\nFROM hangar\nJOIN skills ON hangar.plane_name = skills.plane_name\nGROUP BY hangar.location;',
 'SELECT a.name AS affiliation_name, COUNT(pl.paper_id) AS paper_count\nFROM affiliation a\nJOIN author_list al ON a.affiliation_id = al.affiliation_id\nJOIN paper p ON al.paper_id = p.paper_id\nWHERE p.year = 2009\nGROUP BY a.name\nORDER BY paper_count DESC\nLIMIT 3;',
 'SELECT m.start_date_time, m.end_date_time, c.client_details, s.staff_details\nFROM meetings m\nJOIN clients c ON m.client_id = c.client_id\nJOIN staff_in_meetings sm ON m.meeting_id = sm.meeting_id\nJOIN staff s ON sm.staff_id = s.staff_id;',
 'SELECT s.First_Name, sa.Date_of_Answer\nFROM students s\nJOIN student answers sa ON s.Student_ID = sa.Student_ID;',
 "SELECT COUNT(*) \nFROM pilot_skills \nWHERE plane_name IN (SELECT plane_name FROM hangar WHERE location = 'Chicago');",
 'SELECT Title\nFROM book_1.book\nWHERE ISBN IN (SELECT ISBN FROM book_1.books_order);',
 'SELECT date_of_transcript AS transcript_issuance_date\nFROM transcripts\nWHERE student_id = (\n    SELECT student_id\n    FROM student_loans\n    ORDER BY amount_of_loan DESC\n    LIMIT 1\n);',
 'SELECT agency_id\nFROM agencies\nWHERE agency_id NOT IN (SELECT DISTINCT agency_id FROM clients);',
 'SELECT Conference_Name, COUNT(*) AS Conference_Count\nFROM conference\nGROUP BY Conference_Name;',
 "SELECT DISTINCT d.Owner\nFROM document_objects d\nJOIN documents_in_collections dic ON d.Document_Object_ID = dic.Document_Object_ID\nJOIN documents_in_collections dic_braeden ON dic.Collection_ID = dic_braeden.Collection_ID\nJOIN document_objects d_braeden ON dic_braeden.Document_Object_ID = d_braeden.Document_Object_ID\nWHERE d.Owner <> 'Braeden' AND d_braeden.Owner = 'Braeden';",
 'SELECT SUM(Population) AS total_population, AVG(Population) AS average_population\nFROM district\nWHERE District_ID IN (SELECT District_ID FROM spokesman_district);',
 "SELECT pilot_name\nFROM skills\nWHERE plane_name = 'Piper Cub'\nAND pilot_name NOT IN (\n    SELECT pilot_name\n    FROM skills\n    WHERE plane_name = 'B-52 Bomber'\n);",
 'SELECT Conference_Name\nFROM conference\nWHERE Conference_ID IN (\n    SELECT Conference_ID\n    FROM conference_participation\n    GROUP BY Conference_ID\n    ORDER BY COUNT(*) DESC\n    LIMIT 2\n);',
 'SELECT Contents, SUM(Value) AS total_value, COUNT(*) AS number_of_boxes\nFROM boxes\nGROUP BY Contents;',
 "SELECT PackageNumber, Weight\nFROM package\nWHERE Sender IN (SELECT AccountNumber FROM client WHERE Name LIKE '%John%')\nORDER BY Weight DESC\nLIMIT 1;",
 "SELECT DISTINCT stage_presence\nFROM performance_score ps\nJOIN songs s ON ps.song_id = s.id\nWHERE s.language = 'English';",
 'SELECT s.First_Name, sa.Date_of_Answer\nFROM students s\nJOIN student_answers sa ON s.Student_ID = sa.Student_ID;',
 'SELECT plane_name, AVG(age) AS average_age\nFROM pilot_skills\nGROUP BY plane_name;',
 'SELECT width_mm \nFROM paintings \nWHERE painterID IN (SELECT artistID FROM artists WHERE birthYear < 1850);',
 'SELECT Neighborhood\nFROM store\nWHERE Neighborhood NOT IN (\n    SELECT Neighborhood\n    FROM stock\n    JOIN headphone ON stock.Headphone_ID = headphone.Headphone_ID\n);',
 "SELECT g.Title\nFROM game g\nJOIN platform p ON g.Platform_ID = p.Platform_ID\nWHERE p.Market_district IN ('Asia', 'USA');",
 'SELECT s.bio_data, s.student_details\nFROM students s\nJOIN student_loans sl ON s.student_id = sl.student_id\nWHERE sl.amount_of_loan > (SELECT AVG(amount_of_loan) FROM student_loans);',
 'SELECT Name \nFROM client \nWHERE IdClient NOT IN (SELECT IdClient FROM orders);',
 'SELECT Make\nFROM team\nGROUP BY Make\nHAVING COUNT(DISTINCT Team_ID) > 1;',
 'SELECT Location, \n       SUM(Capacity) AS total_capacity, \n       AVG(Capacity) AS average_capacity, \n       MAX(Capacity) AS max_capacity\nFROM warehouses\nGROUP BY Location;',
 'SELECT Player_name\nFROM player\nWHERE Player_ID NOT IN (SELECT Player_ID FROM game_player);',
 'SELECT meetings.meeting_id, meetings.meeting_outcome, meetings.meeting_type, clients.client_details\nFROM meetings\nJOIN clients ON meetings.client_id = clients.client_id;',
 'SELECT Type\nFROM book\nGROUP BY Type\nHAVING COUNT(Book_ID) >= 3;',
 'SELECT DISTINCT a.birthYear\nFROM artists a\nJOIN sculptures s ON a.artistID = s.sculptorID\nWHERE s.year > 1920;',
 'SELECT author_name\nFROM authors\nGROUP BY author_name\nHAVING COUNT(document_id) >= 2;',
 'SELECT Earpads, COUNT(Headphone_ID) AS Num_Headphones\nFROM headphone\nGROUP BY Earpads\nORDER BY Num_Headphones DESC\nLIMIT 2;',
 'SELECT a.fname AS first_name, COUNT(p.paintingID) AS number_of_paintings\nFROM artists a\nJOIN paintings p ON a.artistID = p.painterID\nGROUP BY a.artistID, a.fname\nHAVING COUNT(p.paintingID) >= 2;',
 'SELECT Country\nFROM player\nGROUP BY Country\nHAVING COUNT(Player_ID) > 1;',
 'SELECT Analytical_Layer_Type_Code, COUNT(*) AS count\nFROM analytical_layer\nGROUP BY Analytical_Layer_Type_Code\nORDER BY count DESC\nLIMIT 1;',
 "SELECT s.name\nFROM staff s\nJOIN conference_participation cp1 ON s.staff_ID = cp1.staff_ID\nJOIN conference_participation cp2 ON s.staff_ID = cp2.staff_ID\nWHERE cp1.role = 'speaker' AND cp2.role = 'sponsor';",
 'SELECT Construction, AVG(Price) AS Average_Cost\nFROM headphone\nGROUP BY Construction;',
 'SELECT Manufacturer, COUNT(*) AS Manufacturer_Count\nFROM club\nGROUP BY Manufacturer\nORDER BY Manufacturer_Count DESC\nLIMIT 1;',
 "SELECT city.state\nFROM student\nJOIN city ON student.city_code = city.city_code\nWHERE student.Fname = 'Linda';",
 'SELECT d.Name\nFROM driver d\nJOIN vehicle_driver vd ON d.Driver_ID = vd.Driver_ID\nJOIN vehicle v ON vd.Vehicle_ID = v.Vehicle_ID\nWHERE v.Power > 5000;',
 'SELECT COUNT(*) \nFROM driver \nJOIN vehicle_driver ON driver.Driver_ID = vehicle_driver.Driver_ID \nJOIN vehicle ON vehicle_driver.Vehicle_ID = vehicle.Vehicle_ID \nWHERE vehicle.Build_Year = 2012;',
 'SELECT DISTINCT birthYear\nFROM artists\nWHERE artistID IN (\n    SELECT sculptorID\n    FROM sculptures\n    WHERE year > 1920\n);',
 'SELECT w.Code\nFROM warehouses w\nJOIN (\n    SELECT b.Warehouse, COUNT(*) AS num_boxes\n    FROM boxes b\n    GROUP BY b.Warehouse\n) box_count ON w.Code = box_count.Warehouse\nWHERE box_count.num_boxes > w.Capacity;',
 "SELECT COUNT(*) \nFROM author_list \nWHERE author_id = (SELECT author_id FROM author WHERE name = 'Mckeown , Kathleen');",
 "SELECT boxes.Code\nFROM boxes\nJOIN warehouses ON boxes.Warehouse = warehouses.Code\nWHERE warehouses.Location IN ('Chicago', 'New York');",
 'SELECT datestamp, property_name\nFROM user_property_history\nJOIN properties ON user_property_history.property_id = properties.property_id\nORDER BY datestamp;',
 "SELECT PackageNumber \nFROM package \nWHERE Recipient = 'Leo Wong';",
 'SELECT v.name, SUM(r.total_hours) AS total_rental_hours\nFROM vehicles v\nJOIN renting_history r ON v.id = r.vehicle_id\nGROUP BY v.name;',
 'SELECT invoices.invoice_id, COUNT(payments.payment_id) AS num_payments\nFROM invoices\nLEFT JOIN payments ON invoices.invoice_id = payments.invoice_id\nGROUP BY invoices.invoice_id;',
 'SELECT a.fname, a.lname\nFROM artists a\nWHERE EXISTS (\n    SELECT 1\n    FROM paintings p\n    WHERE p.painterID = a.artistID\n) AND EXISTS (\n    SELECT 1\n    FROM sculptures s\n    WHERE s.sculptorID = a.artistID\n);',
 'SELECT COUNT(DISTINCT product_id) \nFROM products \nWHERE product_id NOT IN (SELECT DISTINCT product_id FROM order_items);',
 'SELECT pilot_name\nFROM pilot_skills\nWHERE age < (SELECT AVG(age) FROM pilot_skills)\nORDER BY age ASC;',
 "SELECT s.Service_Details\nFROM services s\nJOIN customers_and_services cs ON s.Service_ID = cs.Service_ID\nJOIN customers c ON cs.Customer_ID = c.Customer_ID\nWHERE c.Customer_Details = 'Hardy Kutch';",
 'SELECT product_price, product_size\nFROM products\nWHERE product_price > (SELECT AVG(product_price) FROM products);',
 'SELECT Rank\nFROM review\nWHERE Pages = (SELECT MIN(Pages) FROM book);',
 'SELECT Name \nFROM club \nWHERE Club_ID NOT IN (SELECT Club_ID FROM player);',
 'SELECT Model\nFROM headphone\nWHERE Headphone_ID NOT IN (\n    SELECT Headphone_ID\n    FROM stock\n    WHERE Quantity > 0\n);',
 'SELECT c.Name, c.Internet\nFROM channel c\nJOIN program p ON c.Channel_ID = p.Channel_ID\nGROUP BY c.Channel_ID\nORDER BY COUNT(DISTINCT p.Director_ID) DESC\nLIMIT 1;',
 "SELECT distance \nFROM direct_distance \nWHERE city1_code = 'Boston' AND city2_code = 'Newark';",
 'SELECT name, SUM(total_hours) AS total_renting_hours\nFROM vehicles\nJOIN renting_history ON vehicles.id = renting_history.vehicles_id\nGROUP BY name\nORDER BY total_renting_hours DESC;',
 'SELECT s.sid, s.name\nFROM sailors s\nJOIN reserves r ON s.sid = r.sid\nGROUP BY s.sid, s.name\nHAVING COUNT(DISTINCT r.bid) > 1;',
 'SELECT Completed_Year, COUNT(*) AS num_constructions\nFROM building\nGROUP BY Completed_Year\nORDER BY num_constructions DESC\nLIMIT 1;',
 'SELECT a.Name, a.Gender\nFROM author a\nJOIN book b ON a.Author_ID = b.Author_ID\nGROUP BY a.Author_ID, a.Name, a.Gender\nORDER BY COUNT(b.Book_ID) DESC\nLIMIT 1;',
 'SELECT a.agency_id, a.agency_details\nFROM agencies a\nJOIN clients c ON a.agency_id = c.agency_id\nGROUP BY a.agency_id, a.agency_details\nHAVING COUNT(DISTINCT c.client_id) >= 2;',
 'SELECT Name, Nickname\nFROM institution\nJOIN championship ON institution.Institution_ID = championship.Institution_ID;',
 'SELECT product_color, product_description, product_size\nFROM products\nWHERE product_price < (SELECT MAX(product_price) FROM products);',
 'SELECT COUNT(DISTINCT property_id) \nFROM property_features \nGROUP BY property_id \nHAVING COUNT(feature_id) >= 2;',
 'SELECT AVG(age) AS average_age, make\nFROM driver\nGROUP BY make;',
 'SELECT Food, AVG(Price) AS AveragePrice, MIN(Price) AS MinPrice, MAX(Price) AS MaxPrice\nFROM goods\nGROUP BY Food;',
 'SELECT Food, MIN(Price) AS LowestPrice, MAX(Price) AS HighestPrice\nFROM goods\nGROUP BY Food\nORDER BY Food;',
 "SELECT p.paper_id, p.title\nFROM paper p\nJOIN author_list al1 ON p.paper_id = al1.paper_id\nJOIN author a1 ON al1.author_id = a1.author_id\nJOIN author_list al2 ON p.paper_id = al2.paper_id\nJOIN author a2 ON al2.author_id = a2.author_id\nWHERE (a1.name = 'Mckeown, Kathleen' AND a2.name = 'Rambow, Owen');",
 'SELECT address_type_code, address_type_description\nFROM reference address types\nGROUP BY address_type_code, address_type_description\nORDER BY COUNT(*) DESC\nLIMIT 1;',
 'SELECT o.order_id, o.order_status_code, COUNT(oi.product_id) AS num_products\nFROM orders o\nJOIN order_items oi ON o.order_id = oi.order_id\nGROUP BY o.order_id, o.order_status_code;',
 'SELECT product_id, product_name, product_price, product_color\nFROM products\nWHERE product_id IN (\n    SELECT product_id\n    FROM order_items\n    GROUP BY product_id\n    HAVING COUNT(DISTINCT order_id) < 2\n);',
 "SELECT COUNT(DISTINCT Warehouse) \nFROM boxes \nWHERE Contents = 'Rocks';",
 'SELECT fname AS first_names, COUNT(*) AS number_of_works\nFROM artists\nWHERE artistID IN (\n    SELECT painterID\n    FROM paintings\n    GROUP BY painterID\n    HAVING COUNT(*) >= 2\n);',
 "SELECT major.Major_Name, major_ranking.Rank\nFROM university\nJOIN major_ranking ON university.University_ID = major_ranking.University_ID\nJOIN major ON major_ranking.Major_ID = major.Major_ID\nWHERE university.University_Name = 'Augustana College';",
 'SELECT Name \nFROM club \nWHERE Club_ID NOT IN (SELECT Club_ID FROM player);',
 'SELECT state, COUNT(city_name) AS number_of_cities\nFROM city\nGROUP BY state;',
 "SELECT COUNT(*) \nFROM package \nWHERE Sender = 'Ogden Wernstrom' \nAND Recipient = 'Leo Wong';",
 'SELECT r.Name\nFROM region r\nLEFT JOIN building b ON r.Region_ID = b.Region_ID\nWHERE b.Building_ID IS NULL;',
 "SELECT b.Title\nFROM book_1.book b\nJOIN book_1.orders o ON b.ISBN = o.ISBN\nJOIN book_1.client c ON o.IdClient = c.IdClient\nWHERE c.Name = 'Peter Doe'\nAND c.Name <> 'James Smith';",
 "SELECT Earpads\nFROM headphone\nWHERE Construction <> 'plastic';",
 'SELECT c.Capital \nFROM country c\nJOIN driver d ON c.Country_Id = d.Country\nWHERE d.Points = (SELECT MAX(Points) FROM driver);',
 "SELECT author.name, COUNT(*) AS num_papers\nFROM author\nJOIN author_list ON author.author_id = author_list.author_id\nJOIN author_list AS al2 ON author_list.paper_id = al2.paper_id\nJOIN author AS co_author ON al2.author_id = co_author.author_id\nWHERE co_author.name = 'Mckeown , Kathleen'\nGROUP BY author.author_id\nORDER BY num_papers DESC\nLIMIT 1;",
 'SELECT p.Name\nFROM planet p\nJOIN shipment s ON p.PlanetID = s.Planet\nJOIN package pk ON s.ShipmentID = pk.Shipment\nGROUP BY p.Name\nHAVING SUM(pk.Weight) > 30;',
 "SELECT city_name\nFROM city\nWHERE city_code = (\n    SELECT city2_code\n    FROM direct_distance\n    WHERE city1_code = (\n        SELECT city_code\n        FROM city\n        WHERE city_name = 'Boston'\n    )\n    ORDER BY distance DESC\n    LIMIT 1\n);",
 'SELECT feature_name, feature_description\nFROM features\nWHERE feature_id IN (\n    SELECT feature_id\n    FROM property_features\n    GROUP BY feature_id\n    ORDER BY COUNT(*) DESC\n    LIMIT 1\n);',
 'SELECT m.Title, mt.Name\nFROM movies m\nJOIN movie_theaters mt ON m.Code = mt.Movie;',
 'SELECT product_id, product_description\nFROM products\nWHERE product_id IN (\n    SELECT product_id\n    FROM order_items\n    GROUP BY product_id\n    HAVING COUNT(*) > 3\n);',
 'SELECT process_name \nFROM business_processes \nWHERE process_id = (SELECT next_process_id FROM business_processes WHERE process_id = 9);',
 'SELECT State\nFROM university\nWHERE Enrollment < 3000\nGROUP BY State\nHAVING COUNT(University_ID) > 2;',
 "SELECT * \nFROM package \nWHERE Sender = 'Leo Wong' OR Recipient = 'Leo Wong';",
 'SELECT dc."Document_Object_ID"\nFROM "documents in collections" dc\nJOIN "collections" c ON dc."Collection_ID" = c."Collection_ID"\nJOIN "collections" c2 ON c."Collection_Name" = \'Best\' AND c2."Collection_Name" = \'Best for 2000\'\nWHERE c2."Parent_Collection_ID" = c."Collection_ID";',
 'SELECT c.customer_first_name, p.product_name\nFROM customers c\nJOIN orders o ON c.customer_id = o.customer_id\nJOIN order_items oi ON o.order_id = oi.order_id\nJOIN products p ON oi.product_id = p.product_id;',
 'SELECT p1.pilot_name, p1.plane_name\nFROM pilot_skills p1\nWHERE p1.age = (\n    SELECT MAX(p2.age)\n    FROM pilot_skills p2\n    WHERE p2.plane_name = p1.plane_name\n);',
 'SELECT name AS affiliation_name, COUNT(paper_id) AS num_papers\nFROM affiliation\nJOIN author_list ON affiliation.affiliation_id = author_list.affiliation_id\nGROUP BY affiliation.affiliation_id, affiliation.name\nORDER BY num_papers DESC;',
 'SELECT Warehouse, COUNT(DISTINCT Contents) AS NumDistinctContents\nFROM boxes\nGROUP BY Warehouse;',

In [ ]:
revised_filtered_queries = []
for pred in predicted_queries:
    pred = pred.replace("\n", " ")
    if pred[-1] != ';':
        pred += ';'
    revised_filtered_queries.append(pred)

revised_filtered_queries

['SELECT s.name FROM sailors s JOIN reserves r ON s.sid = r.sid WHERE r.bid = 103;',
 "SELECT s.name FROM sailors s JOIN reserves r ON s.sid = r.sid JOIN boats b ON r.bid = b.bid WHERE b.name = 'Melon';",
 "SELECT AVG(Units_sold_Millions) AS avg_units_sold FROM game JOIN game_player ON game.Game_ID = game_player.Game_ID JOIN player ON game_player.Player_ID = player.Player_ID WHERE player.Position = 'Guard';",
 "SELECT Collection_Subset_Name FROM collections WHERE Parent_Collection_ID = (SELECT Collection_ID FROM collections WHERE Collection_Name = 'Best');",
 'SELECT Analytical_Layer_Type_Code, COUNT(*) AS appearance_count FROM analytical_layer GROUP BY Analytical_Layer_Type_Code ORDER BY appearance_count DESC LIMIT 1;',
 'SELECT Nationality, COUNT(Customer_ID) AS Number_of_Customers FROM customer GROUP BY Nationality;',
 'SELECT c.customer_id, c.customer_name, c.customer_phone, c.customer_email FROM customers c JOIN customer_orders co ON c.customer_id = co.customer_id GROUP BY c.customer_id, c.customer_name, c.customer_phone, c.customer_email ORDER BY COUNT(co.order_id) DESC LIMIT 1;',
 'SELECT name  FROM staff  WHERE Age > (SELECT AVG(Age) FROM staff);',
 'SELECT invoice_id, invoice_status, invoice_details FROM invoices WHERE invoice_id = (SELECT invoice_id                     FROM payments                     GROUP BY invoice_id                     ORDER BY COUNT(*) DESC                     LIMIT 1);',
 'SELECT product_name FROM products WHERE product_price > (SELECT AVG(product_price) FROM products);',
 "SELECT SUM(Weight) AS TotalWeight FROM package WHERE Sender = 'Leo Wong';",
 "SELECT pilot_name, age FROM skills WHERE (plane_name = 'Piper Cub' AND age > 35) OR (plane_name = 'F-14 Fighter' AND age < 30);",
 'SELECT client_id FROM invoices GROUP BY client_id HAVING COUNT(*) >= 2;',
 "SELECT DISTINCT ds.Document_Subset_Name FROM document_subset_members dsm JOIN document_objects do ON dsm.Document_Object_ID = do.Document_Object_ID JOIN document_subsets ds ON dsm.Document_Subset_ID = ds.Document_Subset_ID WHERE do.Owner = 'Braeden';",
 "SELECT AVG(distance)  FROM direct_distance  WHERE city1_code = 'Boston';",
 'SELECT COUNT(DISTINCT Movie) AS distinct_movies FROM movie_theaters;',
 "SELECT age_category_description FROM users JOIN age_categories ON users.age_category_code = age_categories.age_category_code WHERE description LIKE '%Mother%';",
 'SELECT b.ISBN, COUNT(bo.IdOrder) AS OrderCount FROM book b LEFT JOIN books_order bo ON b.ISBN = bo.ISBN GROUP BY b.ISBN;',
 "SELECT DISTINCT p1.pilot_name FROM pilot_skills p1 WHERE EXISTS (     SELECT 1     FROM pilot_skills p2     WHERE p1.pilot_name = p2.pilot_name     AND p2.plane_name IN (         SELECT plane_name         FROM hangar         WHERE location = 'Austin'     ) ) AND EXISTS (     SELECT 1     FROM pilot_skills p3     WHERE p1.pilot_name = p3.pilot_name     AND p3.plane_name IN (         SELECT plane_name         FROM hangar         WHERE location = 'Boston'     ) );",
 'SELECT a.Name, a.Gender FROM author a JOIN book b ON a.Author_ID = b.Author_ID GROUP BY a.Author_ID ORDER BY COUNT(b.Book_ID) DESC LIMIT 1;',
 "SELECT COUNT(DISTINCT p.pilot_name)  FROM pilot_skills p  JOIN hangar h ON p.plane_name = h.plane_name  WHERE h.location = 'Chicago';",
 'SELECT c.Customer_ID, c.Customer_Details FROM customers c JOIN customers_and_services cs ON c.Customer_ID = cs.Customer_ID GROUP BY c.Customer_ID, c.Customer_Details ORDER BY COUNT(cs.Service_ID) DESC LIMIT 1;',
 'SELECT DISTINCT r.CustomerId FROM receipts r JOIN items i ON r.ReceiptNumber = i.Receipt JOIN goods g ON i.Item = g.Id GROUP BY r.CustomerId HAVING AVG(g.Price) > 5;',
 'SELECT product_name FROM products WHERE product_id NOT IN (SELECT product_id FROM order_items);',
 'SELECT d.Document_Object_ID, COUNT(dc.Document_Object_ID) AS num_related_documents FROM documents_in_collections dc JOIN document_objects d ON dc.Document_Object_ID = d.Document_Object_ID GROUP BY d.Document_Object_ID HAVING COUNT(dc.Document_Object_ID) BETWEEN 2 AND 4;',
 'SELECT detention_type_code, detention_type_description FROM reference_detention_type ORDER BY detention_type_code LIMIT 1;',
 'SELECT Student_Answer_Text FROM student_answers ORDER BY COUNT(*) DESC;',
 'SELECT c1.Collection_Name FROM collections c1 LEFT JOIN collections c2 ON c1.Collection_ID = c2.Parent_Collection_ID WHERE c2.Parent_Collection_ID IS NULL;',
 'SELECT c.Name, co.Dish_Name FROM customer c JOIN customer_order co ON c.Customer_ID = co.Customer_ID;',
 'SELECT fname, lname FROM artists WHERE artistID IN (     SELECT painterID     FROM paintings     WHERE painterID NOT IN (         SELECT sculptorID         FROM sculptures     ) );',
 'SELECT sa.Email_Adress, sa.Date_of_Answer FROM students s JOIN student answers sa ON s.Student_ID = sa.Student_ID ORDER BY sa.Date_of_Answer DESC;',
 'SELECT r.Transmitter, COUNT(cc.City_channel_ID) AS Number_of_City_Channels FROM radio r JOIN city_channel_radio ccr ON r.Radio_ID = ccr.Radio_ID GROUP BY r.Transmitter;',
 'SELECT hangar.location AS city, COUNT(pilot_name) AS number_of_pilots, AVG(age) AS average_age FROM hangar JOIN skills ON hangar.plane_name = skills.plane_name GROUP BY hangar.location;',
 'SELECT a.name AS affiliation_name, COUNT(pl.paper_id) AS paper_count FROM affiliation a JOIN author_list al ON a.affiliation_id = al.affiliation_id JOIN paper p ON al.paper_id = p.paper_id WHERE p.year = 2009 GROUP BY a.name ORDER BY paper_count DESC LIMIT 3;',
 'SELECT m.start_date_time, m.end_date_time, c.client_details, s.staff_details FROM meetings m JOIN clients c ON m.client_id = c.client_id JOIN staff_in_meetings sm ON m.meeting_id = sm.meeting_id JOIN staff s ON sm.staff_id = s.staff_id;',
 'SELECT s.First_Name, sa.Date_of_Answer FROM students s JOIN student answers sa ON s.Student_ID = sa.Student_ID;',
 "SELECT COUNT(*)  FROM pilot_skills  WHERE plane_name IN (SELECT plane_name FROM hangar WHERE location = 'Chicago');",
 'SELECT Title FROM book_1.book WHERE ISBN IN (SELECT ISBN FROM book_1.books_order);',
 'SELECT date_of_transcript AS transcript_issuance_date FROM transcripts WHERE student_id = (     SELECT student_id     FROM student_loans     ORDER BY amount_of_loan DESC     LIMIT 1 );',
 'SELECT agency_id FROM agencies WHERE agency_id NOT IN (SELECT DISTINCT agency_id FROM clients);',
 'SELECT Conference_Name, COUNT(*) AS Conference_Count FROM conference GROUP BY Conference_Name;',
 "SELECT DISTINCT d.Owner FROM document_objects d JOIN documents_in_collections dic ON d.Document_Object_ID = dic.Document_Object_ID JOIN documents_in_collections dic_braeden ON dic.Collection_ID = dic_braeden.Collection_ID JOIN document_objects d_braeden ON dic_braeden.Document_Object_ID = d_braeden.Document_Object_ID WHERE d.Owner <> 'Braeden' AND d_braeden.Owner = 'Braeden';",
 'SELECT SUM(Population) AS total_population, AVG(Population) AS average_population FROM district WHERE District_ID IN (SELECT District_ID FROM spokesman_district);',
 "SELECT pilot_name FROM skills WHERE plane_name = 'Piper Cub' AND pilot_name NOT IN (     SELECT pilot_name     FROM skills     WHERE plane_name = 'B-52 Bomber' );",
 'SELECT Conference_Name FROM conference WHERE Conference_ID IN (     SELECT Conference_ID     FROM conference_participation     GROUP BY Conference_ID     ORDER BY COUNT(*) DESC     LIMIT 2 );',
 'SELECT Contents, SUM(Value) AS total_value, COUNT(*) AS number_of_boxes FROM boxes GROUP BY Contents;',
 "SELECT PackageNumber, Weight FROM package WHERE Sender IN (SELECT AccountNumber FROM client WHERE Name LIKE '%John%') ORDER BY Weight DESC LIMIT 1;",
 "SELECT DISTINCT stage_presence FROM performance_score ps JOIN songs s ON ps.song_id = s.id WHERE s.language = 'English';",
 'SELECT s.First_Name, sa.Date_of_Answer FROM students s JOIN student_answers sa ON s.Student_ID = sa.Student_ID;',
 'SELECT plane_name, AVG(age) AS average_age FROM pilot_skills GROUP BY plane_name;',
 'SELECT width_mm  FROM paintings  WHERE painterID IN (SELECT artistID FROM artists WHERE birthYear < 1850);',
 'SELECT Neighborhood FROM store WHERE Neighborhood NOT IN (     SELECT Neighborhood     FROM stock     JOIN headphone ON stock.Headphone_ID = headphone.Headphone_ID );',
 "SELECT g.Title FROM game g JOIN platform p ON g.Platform_ID = p.Platform_ID WHERE p.Market_district IN ('Asia', 'USA');",
 'SELECT s.bio_data, s.student_details FROM students s JOIN student_loans sl ON s.student_id = sl.student_id WHERE sl.amount_of_loan > (SELECT AVG(amount_of_loan) FROM student_loans);',
 'SELECT Name  FROM client  WHERE IdClient NOT IN (SELECT IdClient FROM orders);',
 'SELECT Make FROM team GROUP BY Make HAVING COUNT(DISTINCT Team_ID) > 1;',
 'SELECT Location,         SUM(Capacity) AS total_capacity,         AVG(Capacity) AS average_capacity,         MAX(Capacity) AS max_capacity FROM warehouses GROUP BY Location;',
 'SELECT Player_name FROM player WHERE Player_ID NOT IN (SELECT Player_ID FROM game_player);',
 'SELECT meetings.meeting_id, meetings.meeting_outcome, meetings.meeting_type, clients.client_details FROM meetings JOIN clients ON meetings.client_id = clients.client_id;',
 'SELECT Type FROM book GROUP BY Type HAVING COUNT(Book_ID) >= 3;',
 'SELECT DISTINCT a.birthYear FROM artists a JOIN sculptures s ON a.artistID = s.sculptorID WHERE s.year > 1920;',
 'SELECT author_name FROM authors GROUP BY author_name HAVING COUNT(document_id) >= 2;',
 'SELECT Earpads, COUNT(Headphone_ID) AS Num_Headphones FROM headphone GROUP BY Earpads ORDER BY Num_Headphones DESC LIMIT 2;',
 'SELECT a.fname AS first_name, COUNT(p.paintingID) AS number_of_paintings FROM artists a JOIN paintings p ON a.artistID = p.painterID GROUP BY a.artistID, a.fname HAVING COUNT(p.paintingID) >= 2;',
 'SELECT Country FROM player GROUP BY Country HAVING COUNT(Player_ID) > 1;',
 'SELECT Analytical_Layer_Type_Code, COUNT(*) AS count FROM analytical_layer GROUP BY Analytical_Layer_Type_Code ORDER BY count DESC LIMIT 1;',
 "SELECT s.name FROM staff s JOIN conference_participation cp1 ON s.staff_ID = cp1.staff_ID JOIN conference_participation cp2 ON s.staff_ID = cp2.staff_ID WHERE cp1.role = 'speaker' AND cp2.role = 'sponsor';",
 'SELECT Construction, AVG(Price) AS Average_Cost FROM headphone GROUP BY Construction;',
 'SELECT Manufacturer, COUNT(*) AS Manufacturer_Count FROM club GROUP BY Manufacturer ORDER BY Manufacturer_Count DESC LIMIT 1;',
 "SELECT city.state FROM student JOIN city ON student.city_code = city.city_code WHERE student.Fname = 'Linda';",
 'SELECT d.Name FROM driver d JOIN vehicle_driver vd ON d.Driver_ID = vd.Driver_ID JOIN vehicle v ON vd.Vehicle_ID = v.Vehicle_ID WHERE v.Power > 5000;',
 'SELECT COUNT(*)  FROM driver  JOIN vehicle_driver ON driver.Driver_ID = vehicle_driver.Driver_ID  JOIN vehicle ON vehicle_driver.Vehicle_ID = vehicle.Vehicle_ID  WHERE vehicle.Build_Year = 2012;',
 'SELECT DISTINCT birthYear FROM artists WHERE artistID IN (     SELECT sculptorID     FROM sculptures     WHERE year > 1920 );',
 'SELECT w.Code FROM warehouses w JOIN (     SELECT b.Warehouse, COUNT(*) AS num_boxes     FROM boxes b     GROUP BY b.Warehouse ) box_count ON w.Code = box_count.Warehouse WHERE box_count.num_boxes > w.Capacity;',
 "SELECT COUNT(*)  FROM author_list  WHERE author_id = (SELECT author_id FROM author WHERE name = 'Mckeown , Kathleen');",
 "SELECT boxes.Code FROM boxes JOIN warehouses ON boxes.Warehouse = warehouses.Code WHERE warehouses.Location IN ('Chicago', 'New York');",
 'SELECT datestamp, property_name FROM user_property_history JOIN properties ON user_property_history.property_id = properties.property_id ORDER BY datestamp;',
 "SELECT PackageNumber  FROM package  WHERE Recipient = 'Leo Wong';",
 'SELECT v.name, SUM(r.total_hours) AS total_rental_hours FROM vehicles v JOIN renting_history r ON v.id = r.vehicle_id GROUP BY v.name;',
 'SELECT invoices.invoice_id, COUNT(payments.payment_id) AS num_payments FROM invoices LEFT JOIN payments ON invoices.invoice_id = payments.invoice_id GROUP BY invoices.invoice_id;',
 'SELECT a.fname, a.lname FROM artists a WHERE EXISTS (     SELECT 1     FROM paintings p     WHERE p.painterID = a.artistID ) AND EXISTS (     SELECT 1     FROM sculptures s     WHERE s.sculptorID = a.artistID );',
 'SELECT COUNT(DISTINCT product_id)  FROM products  WHERE product_id NOT IN (SELECT DISTINCT product_id FROM order_items);',
 'SELECT pilot_name FROM pilot_skills WHERE age < (SELECT AVG(age) FROM pilot_skills) ORDER BY age ASC;',
 "SELECT s.Service_Details FROM services s JOIN customers_and_services cs ON s.Service_ID = cs.Service_ID JOIN customers c ON cs.Customer_ID = c.Customer_ID WHERE c.Customer_Details = 'Hardy Kutch';",
 'SELECT product_price, product_size FROM products WHERE product_price > (SELECT AVG(product_price) FROM products);',
 'SELECT Rank FROM review WHERE Pages = (SELECT MIN(Pages) FROM book);',
 'SELECT Name  FROM club  WHERE Club_ID NOT IN (SELECT Club_ID FROM player);',
 'SELECT Model FROM headphone WHERE Headphone_ID NOT IN (     SELECT Headphone_ID     FROM stock     WHERE Quantity > 0 );',
 'SELECT c.Name, c.Internet FROM channel c JOIN program p ON c.Channel_ID = p.Channel_ID GROUP BY c.Channel_ID ORDER BY COUNT(DISTINCT p.Director_ID) DESC LIMIT 1;',
 "SELECT distance  FROM direct_distance  WHERE city1_code = 'Boston' AND city2_code = 'Newark';",
 'SELECT name, SUM(total_hours) AS total_renting_hours FROM vehicles JOIN renting_history ON vehicles.id = renting_history.vehicles_id GROUP BY name ORDER BY total_renting_hours DESC;',
 'SELECT s.sid, s.name FROM sailors s JOIN reserves r ON s.sid = r.sid GROUP BY s.sid, s.name HAVING COUNT(DISTINCT r.bid) > 1;',
 'SELECT Completed_Year, COUNT(*) AS num_constructions FROM building GROUP BY Completed_Year ORDER BY num_constructions DESC LIMIT 1;',
 'SELECT a.Name, a.Gender FROM author a JOIN book b ON a.Author_ID = b.Author_ID GROUP BY a.Author_ID, a.Name, a.Gender ORDER BY COUNT(b.Book_ID) DESC LIMIT 1;',
 'SELECT a.agency_id, a.agency_details FROM agencies a JOIN clients c ON a.agency_id = c.agency_id GROUP BY a.agency_id, a.agency_details HAVING COUNT(DISTINCT c.client_id) >= 2;',
 'SELECT Name, Nickname FROM institution JOIN championship ON institution.Institution_ID = championship.Institution_ID;',
 'SELECT product_color, product_description, product_size FROM products WHERE product_price < (SELECT MAX(product_price) FROM products);',
 'SELECT COUNT(DISTINCT property_id)  FROM property_features  GROUP BY property_id  HAVING COUNT(feature_id) >= 2;',
 'SELECT AVG(age) AS average_age, make FROM driver GROUP BY make;',
 'SELECT Food, AVG(Price) AS AveragePrice, MIN(Price) AS MinPrice, MAX(Price) AS MaxPrice FROM goods GROUP BY Food;',
 'SELECT Food, MIN(Price) AS LowestPrice, MAX(Price) AS HighestPrice FROM goods GROUP BY Food ORDER BY Food;',
 "SELECT p.paper_id, p.title FROM paper p JOIN author_list al1 ON p.paper_id = al1.paper_id JOIN author a1 ON al1.author_id = a1.author_id JOIN author_list al2 ON p.paper_id = al2.paper_id JOIN author a2 ON al2.author_id = a2.author_id WHERE (a1.name = 'Mckeown, Kathleen' AND a2.name = 'Rambow, Owen');",
 'SELECT address_type_code, address_type_description FROM reference address types GROUP BY address_type_code, address_type_description ORDER BY COUNT(*) DESC LIMIT 1;',
 'SELECT o.order_id, o.order_status_code, COUNT(oi.product_id) AS num_products FROM orders o JOIN order_items oi ON o.order_id = oi.order_id GROUP BY o.order_id, o.order_status_code;',
 'SELECT product_id, product_name, product_price, product_color FROM products WHERE product_id IN (     SELECT product_id     FROM order_items     GROUP BY product_id     HAVING COUNT(DISTINCT order_id) < 2 );',
 "SELECT COUNT(DISTINCT Warehouse)  FROM boxes  WHERE Contents = 'Rocks';",
 'SELECT fname AS first_names, COUNT(*) AS number_of_works FROM artists WHERE artistID IN (     SELECT painterID     FROM paintings     GROUP BY painterID     HAVING COUNT(*) >= 2 );',
 "SELECT major.Major_Name, major_ranking.Rank FROM university JOIN major_ranking ON university.University_ID = major_ranking.University_ID JOIN major ON major_ranking.Major_ID = major.Major_ID WHERE university.University_Name = 'Augustana College';",
 'SELECT Name  FROM club  WHERE Club_ID NOT IN (SELECT Club_ID FROM player);',
 'SELECT state, COUNT(city_name) AS number_of_cities FROM city GROUP BY state;',
 "SELECT COUNT(*)  FROM package  WHERE Sender = 'Ogden Wernstrom'  AND Recipient = 'Leo Wong';",
 'SELECT r.Name FROM region r LEFT JOIN building b ON r.Region_ID = b.Region_ID WHERE b.Building_ID IS NULL;',
 "SELECT b.Title FROM book_1.book b JOIN book_1.orders o ON b.ISBN = o.ISBN JOIN book_1.client c ON o.IdClient = c.IdClient WHERE c.Name = 'Peter Doe' AND c.Name <> 'James Smith';",
 "SELECT Earpads FROM headphone WHERE Construction <> 'plastic';",
 'SELECT c.Capital  FROM country c JOIN driver d ON c.Country_Id = d.Country WHERE d.Points = (SELECT MAX(Points) FROM driver);',
 "SELECT author.name, COUNT(*) AS num_papers FROM author JOIN author_list ON author.author_id = author_list.author_id JOIN author_list AS al2 ON author_list.paper_id = al2.paper_id JOIN author AS co_author ON al2.author_id = co_author.author_id WHERE co_author.name = 'Mckeown , Kathleen' GROUP BY author.author_id ORDER BY num_papers DESC LIMIT 1;",
 'SELECT p.Name FROM planet p JOIN shipment s ON p.PlanetID = s.Planet JOIN package pk ON s.ShipmentID = pk.Shipment GROUP BY p.Name HAVING SUM(pk.Weight) > 30;',
 "SELECT city_name FROM city WHERE city_code = (     SELECT city2_code     FROM direct_distance     WHERE city1_code = (         SELECT city_code         FROM city         WHERE city_name = 'Boston'     )     ORDER BY distance DESC     LIMIT 1 );",
 'SELECT feature_name, feature_description FROM features WHERE feature_id IN (     SELECT feature_id     FROM property_features     GROUP BY feature_id     ORDER BY COUNT(*) DESC     LIMIT 1 );',
 'SELECT m.Title, mt.Name FROM movies m JOIN movie_theaters mt ON m.Code = mt.Movie;',
 'SELECT product_id, product_description FROM products WHERE product_id IN (     SELECT product_id     FROM order_items     GROUP BY product_id     HAVING COUNT(*) > 3 );',
 'SELECT process_name  FROM business_processes  WHERE process_id = (SELECT next_process_id FROM business_processes WHERE process_id = 9);',
 'SELECT State FROM university WHERE Enrollment < 3000 GROUP BY State HAVING COUNT(University_ID) > 2;',
 "SELECT *  FROM package  WHERE Sender = 'Leo Wong' OR Recipient = 'Leo Wong';",
 'SELECT dc."Document_Object_ID" FROM "documents in collections" dc JOIN "collections" c ON dc."Collection_ID" = c."Collection_ID" JOIN "collections" c2 ON c."Collection_Name" = \'Best\' AND c2."Collection_Name" = \'Best for 2000\' WHERE c2."Parent_Collection_ID" = c."Collection_ID";',
 'SELECT c.customer_first_name, p.product_name FROM customers c JOIN orders o ON c.customer_id = o.customer_id JOIN order_items oi ON o.order_id = oi.order_id JOIN products p ON oi.product_id = p.product_id;',
 'SELECT p1.pilot_name, p1.plane_name FROM pilot_skills p1 WHERE p1.age = (     SELECT MAX(p2.age)     FROM pilot_skills p2     WHERE p2.plane_name = p1.plane_name );',
 'SELECT name AS affiliation_name, COUNT(paper_id) AS num_papers FROM affiliation JOIN author_list ON affiliation.affiliation_id = author_list.affiliation_id GROUP BY affiliation.affiliation_id, affiliation.name ORDER BY num_papers DESC;',
 'SELECT Warehouse, COUNT(DISTINCT Contents) AS NumDistinctContents FROM boxes GROUP BY Warehouse;',
 'SELECT Nationality FROM member WHERE Age > 22 AND Nationality IN (     SELECT Nationality     FROM member     WHERE Age < 19 );',
 "SELECT u.University_Name FROM university u JOIN major_ranking mr1 ON u.University_ID = mr1.University_ID JOIN major m1 ON mr1.Major_ID = m1.Major_ID AND m1.Major_Name = 'Accounting' JOIN major_ranking mr2 ON u.University_ID = mr2.University_ID JOIN major m2 ON mr2.Major_ID = m2.Major_ID AND m2.Major_Name = 'Urban Education';",

In [ ]:
def substitute_consecutive_spaces(text):
    # Substitute consecutive spaces with a single space
    return re.sub(r'\s+', ' ', text)

In [ ]:
def substitute_percent(text):
    # Substitute consecutive spaces with a single space
    return re.sub(r'%', '', text)

In [ ]:
refined = []
for item in revised_filtered_queries:
    rf = substitute_consecutive_spaces(item)
    substitute_percent(rf)
    refined.append(substitute_consecutive_spaces(item))

In [ ]:
for r in refined:
    if r[-1] != ";":
        print("yes")

In [ ]:
with open('/content/drive/MyDrive/spider/results/sampled_tables_wo_samples_gpt3.5.txt', mode='wt', encoding='utf-8') as myfile:
    myfile.write('\n'.join(refined))

# Both samples and tables

In [ ]:
import openai
import re
import time

# Function to extract SQL statements from text
def extract_sql_statements(text):
    sql_statements = re.findall(r'```sql(.*?)```', text, re.DOTALL)
    return [statement.strip() for statement in sql_statements]

# Function to convert questions to a formatted string
def questions_to_str(q_list):
    q_sql_format = """
        Question: {}
        Database: {}
        SQL:{}

    """
    q_all = " "
    for q in q_list:
        q_all += q_sql_format.format(q['original_question'], q['db_id'], q['sql_query'])

    return q_all

# Function to generate SQL query using OpenAI's API
def generate_sql_query(similar_data, db_data, alpaca_prompt):
    predicted_queries = []
    full_results = []

    for item in similar_data:
        time.sleep(2)
        question = item['question']
        similar_questions = item['similar_q']
        db_id = item['db_id']
        tabs = db_data[db_id]
        similar_formatted = questions_to_str(similar_questions)
        prompt = alpaca_prompt.format(similar_formatted, question, db_id, "\n".join(tabs))
        response = client.chat.completions.create(
            model="gpt-3.5-turbo",
            messages=[
                {"role": "system", "content": "You are a helpful assistant that produces SQL Queries from the given question."},
                {"role": "user", "content": prompt}
            ],
            max_tokens=2000,
            temperature=0
        )
        output_text = response.choices[0].message.content
        sql_query = extract_sql_statements(output_text)[-1]
        sql = sql_query.split(";")[0] + ";"
        predicted_queries.append(sql)
        print(sql)
        full_results.append(output_text)

    return predicted_queries, full_results

In [ ]:
predicted_queries, full_results = generate_sql_query(similar_data, db_data, alpaca_prompt_v2)

In [ ]:
revised_filtered_queries = []
for pred in predicted_queries:
    pred = pred.replace("\n", " ")
    if pred[-1] != ';':
        pred += ';'
    revised_filtered_queries.append(pred)

revised_filtered_queries

In [ ]:
refined = []
for item in revised_filtered_queries:
    rf = substitute_consecutive_spaces(item)
    substitute_percent(rf)
    refined.append(substitute_consecutive_spaces(item))

In [ ]:
with open('/content/drive/MyDrive/spider/results/sampled_tables_samples_gpt3.5.txt', mode='wt', encoding='utf-8') as myfile:
    myfile.write('\n'.join(refined))